## <font color = "purple"> Exploratory Data Analysis </font>

In [1]:
# Import libaries 
import pandas as pd
import os

In [2]:
# Read the data
os.listdir("data")
df = pd.ExcelFile("data/AGO STOCK MOVEMENT 2015.xlsx")
print(df.sheet_names)

# January data
jan = pd.read_excel(df, "JANUARY 2015", skiprows=5)
jan = jan[["DATE", "SALES"]]
jan = jan.iloc[0:32,:]
jan.tail()

['JANUARY 2015', 'FEBRUARY 2015', 'MARCH 2015', 'APRIL 2015', 'MAY 2015', 'JUNE 2015', 'JULY 2015', 'AUGUST 2015', 'SEPTEMBER 2015']

         DATE    SALES
27 2015-01-27  6870.83
28 2015-01-28  6042.06
29 2015-01-29  5947.24
30 2015-01-30  6324.38
31 2015-01-31  4880.65

In [3]:
# February data
feb = pd.read_excel(df, "FEBRUARY 2015", skiprows=5)
feb = feb[["DATE","SALES"]]
feb = feb.iloc[0:29,:]
feb.head()
# Concatinating the two
final= pd.concat([jan, feb])
final.shape

(61, 2)

In [18]:
# Using a for loop to concatenate the sheets
# Define the sheet names

file_path = "data/AGO STOCK MOVEMENT 2015.xlsx"
sheet_names = ['JANUARY 2015', 'FEBRUARY 2015', 'MARCH 2015', 'APRIL 2015', 'MAY 2015', 'JUNE 2015', 'JULY 2015', 'AUGUST 2015', 'SEPTEMBER 2015']# list to store the final dataframe

cleaned_data = []
for sheet_name in sheet_names:
    df = pd.read_excel(file_path, sheet_name, skiprows = 5)
    df = df[["DATE", "SALES"]].iloc[0:32,:]
    cleaned_data.append(df)
# concatenate dataframes
dt = pd.concat(cleaned_data)
print(dt)

                   DATE    SALES
0                   NaT      NaN
1   2015-01-01 00:00:00  3171.43
2   2015-01-02 00:00:00  3843.45
3   2015-01-03 00:00:00  3556.74
4   2015-01-04 00:00:00  3482.36
..                  ...      ...
27  2015-08-27 00:00:00      NaN
28  2015-08-28 00:00:00      NaN
29  2015-08-29 00:00:00      NaN
30  2015-08-30 00:00:00      NaN
31  2015-08-31 00:00:00      NaN

[288 rows x 2 columns]

In [20]:
# The column names
dt.columns

Index(['DATE', 'SALES'], dtype='object')

In [21]:
# Number of rows and columns
dt.shape

(288, 2)

In [23]:
# Summary statistics
dt["SALES"].describe()

count      252.00
unique     250.00
top       3843.45
freq         2.00
Name: SALES, dtype: float64

In [24]:
# Column types
dt.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 288 entries, 0 to 31
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DATE    277 non-null    object
 1   SALES   252 non-null    object
dtypes: object(2)
memory usage: 6.8+ KB

In [32]:
# Checking for nulls
dt.isnull().sum()
# Impute the nulls
dt_upd = dt.dropna()

In [33]:
dt_upd.shape

(252, 2)

In [ ]:
<font_color=red>Visualization</font>